trade_exp/src/Documents/ГрафикВыходаВодителей/ГрафикВыходаВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d4584df-31c9-42b8-bfbd-2c116acdb5e2">
  <name>ГрафикВыходаВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="64fbaa50-1e61-49f0-b088-1daf39e07d84">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37a1d8ed-cde0-4f9e-ae42-cc0af8c2d9ed">
    <name>ПланФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e851a61-b832-4cee-b13e-5781496ef14d">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e83ef77-f800-410c-8261-65bf25dc3db5">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="65a55a79-e302-4248-9095-8bcdfac1c18c">
    <name>ПериодРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="c3c20324-641f-4963-a246-2ad974f75c01">
    <name>График</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6558910b-6305-4a65-8122-06b536ff176b">
      <name>Представление17</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="128aecc0-0541-4ebc-b1b1-ac4e3a71420a">
      <name>Представление14</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="05835100-e434-44e1-8c47-b1ea87290a61">
      <name>Представление18</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e58edd9f-2902-4f6c-b937-21cac4fd7788">
      <name>Представление8</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bac0343f-97e6-493c-88f2-f5bfe262ae01">
      <name>Представление20</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e2a22b3d-5867-4555-acd0-7e9301cba0ce">
      <name>Представление10</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1bb321a4-709a-4cc3-b73d-a2fd107b16c8">
      <name>Представление27</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b4ac0ab8-8a7e-4a85-8e7a-56862b7753bb">
      <name>Водитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4e254b46-11cf-4efa-bcab-24dd92a78d08">
      <name>Представление12</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e38f9446-d03b-47dc-8b7c-bef27deb6f7d">
      <name>Автомобиль</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a8d711dc-ec11-44e8-b772-33486173a421">
      <name>Представление7</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="24d9719c-7e75-4d84-a118-dc0a3920a930">
      <name>Представление1</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7b9dbb39-83b0-4ed1-b60a-69abe96dab71">
      <name>Представление2</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c59f8043-f0fa-4a56-bfd3-a59772a94d0e">
      <name>Представление28</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aefea4c3-bd1d-4725-b4d9-da957e3f2626">
      <name>Представление3</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="66a55d56-006d-44a2-a48e-3bee8aa460f8">
      <name>Представление4</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5c5f8a61-05ec-4ab8-a9c5-04134e61d0e1">
      <name>Представление5</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="18983cf0-889a-41d4-a344-2a8e2e044acf">
      <name>Представление6</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b19eabeb-18c7-4aa0-a66c-dcfbf6a46d31">
      <name>Представление11</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4021812b-868f-47dc-844f-b83097fde19f">
      <name>Представление9</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a80889db-52cb-4a0e-ab70-4cf8c82229a4">
      <name>Представление31</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8fa4781b-db2d-4132-83a0-26dd9d4b50b4">
      <name>Представление13</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="642cf82a-f36c-4274-8c2e-3c822f98ea9e">
      <name>Представление15</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b78f1962-a38a-4273-86a1-baafa0fd9874">
      <name>Представление16</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="103ec266-56ae-4cfd-a809-0d88f3953adb">
      <name>КоличествоВыходов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8d76a6a6-3c5b-432f-9e7c-bd1348e4d552">
      <name>Представление26</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d1947ae6-57fa-4a27-8083-65d161796424">
      <name>Представление19</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7878d53c-dd7d-4314-ab6a-0f74becb46c9">
      <name>Представление21</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6b39b437-5d6e-4801-83c0-6c381af113d4">
      <name>Представление22</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4de1fb48-8950-4009-913b-8ff442f6044a">
      <name>Представление23</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2e6224a7-4654-4056-8970-717dbb5aa920">
      <name>Представление24</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8f3837f4-3f97-440f-b3fa-1d61ebcbe603">
      <name>Представление25</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0bb48c47-b607-48d2-9fc4-8f33f244b9fc">
      <name>Представление29</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e260b36e-d3d7-44ba-a2a4-b059b49c89b8">
      <name>Представление30</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/СвязьВодителейТСПартнеров/СвязьВодителейТСПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="eb125a4a-2018-46b7-bc32-442bfc136d50">
  <name>СвязьВодителейТСПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="67971b02-7a47-421b-a275-6486ff55e6af">
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f1d4008a-5adb-4220-8220-39879b536bbf">
    <name>ПеревозчикКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="10a87189-b92d-4f84-9042-9221d5252c29">
    <name>ИдентификаторКурьераВМониторинге</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="72382cb3-5601-4e31-b2ac-07b13dbb0707">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="07d483ee-db9f-4414-ac7b-b63c09ab9521">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыВодителей/СтатусыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80675a86-f1b3-42aa-bbed-b443ea3fba8a">
  <name>СтатусыВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="24cec108-8195-4aad-a265-e2495c813871">
    <name>Готов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="25759240-bbde-4bc4-8a69-610103245566">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8b61fd48-1b3f-434a-9f2d-7e7107b62b28">
    <name>НеГотов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7423ebb7-3eff-4d31-ba72-320c2bd8592c">
    <name>Возвращается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ГрафикВыходаВодителей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ГрафикВыходаВодителей";
	КомандаПечати.Идентификатор = "ГрафикВыходаВодителей";
	КомандаПечати.Представление = НСтр("ru = 'График выхода водителей'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 1; 
	
КонецПроцедуры
	
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		СформироватьПечатнуюФорму(Ссылка, ТабДок);
	КонецЦикла;
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ГрафикВыходаВодителей", НСтр("ru = 'График выхода водителей'"), ТабДок);

КонецПроцедуры
	
Процедура СформироватьПечатнуюФорму(Ссылка, ТабДок)
	
	Макет = ПолучитьМакет("ГрафикВыходаВодителей");
	КолДнейВМес = День(КонецМесяца(Ссылка.ПериодРегистрации));
	ГраницаДляОстальных = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	ГраницаДляПоследней = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	
	ОбластьЗаголовокОсн = Макет.ПолучитьОбласть("Заголовок|Осн");
	ОбластьЗаголовокДень = Макет.ПолучитьОбласть("Заголовок|День");
	ОбластьЗаголовокИтогВертикальный = Макет.ПолучитьОбласть("Заголовок|ИтогВертикальный");
	
	ОбластьШапкаОсн = Макет.ПолучитьОбласть("Шапка|Осн");
	ОбластьШапкаДень = Макет.ПолучитьОбласть("Шапка|День");
	ОбластьШапкаИтогВертикальный = Макет.ПолучитьОбласть("Шапка|ИтогВертикальный");
	
	ОбластьСтрокаОсн = Макет.ПолучитьОбласть("Строка|Осн");
	ОбластьСтрокаДень = Макет.ПолучитьОбласть("Строка|День");
	ОбластьСтрокаИтогВертикальный = Макет.ПолучитьОбласть("Строка|ИтогВертикальный");
	
	ПоГрузоподъемностиОсн = Макет.ПолучитьОбласть("ПоГрузоподъемности|Осн");
	ПоГрузоподъемностиДень = Макет.ПолучитьОбласть("ПоГрузоподъемности|День");
	ПоГрузоподъемностиИтогВертикальный = Макет.ПолучитьОбласть("ПоГрузоподъемности|ИтогВертикальный");
	
	ОбластьЛинияОсн = Макет.ПолучитьОбласть("Линия|Осн");
	ОбластьЛинияДень = Макет.ПолучитьОбласть("Линия|День");
	ОбластьЛинияИтогВертикальный = Макет.ПолучитьОбласть("Линия|ИтогВертикальный");
	
	ОбластьПодвалОсн = Макет.ПолучитьОбласть("Подвал|Осн");
	ОбластьПодвалДень = Макет.ПолучитьОбласть("Подвал|День");
	ОбластьПодвалИтогВертикальный = Макет.ПолучитьОбласть("Подвал|ИтогВертикальный");
	
	РасшифровкаОсн = Макет.ПолучитьОбласть("Расшифровка|Осн");
	РасшифровкаДень = Макет.ПолучитьОбласть("Расшифровка|День");
	РасшифровкаИтогВертикальный = Макет.ПолучитьОбласть("Расшифровка|ИтогВертикальный");
	
	ВодителиСогласованоОсн = Макет.ПолучитьОбласть("ВодителиСогласовано|Осн");
	ВодителиСогласованоДень = Макет.ПолучитьОбласть("ВодителиСогласовано|День");
	ВодителиСогласованоИтогВертикальный = Макет.ПолучитьОбласть("ВодителиСогласовано|ИтогВертикальный");
	
	ВодителиСтрокаОсн = Макет.ПолучитьОбласть("ВодителиСтрока|Осн");
	ВодителиСтрокаДень = Макет.ПолучитьОбласть("ВодителиСтрока|День");
	ВодителиСтрокаИтогВертикальный = Макет.ПолучитьОбласть("ВодителиСтрока|ИтогВертикальный");
	
	//Заголовок
	ОбластьЗаголовокОсн.Параметры.ПериодРегистрации = Формат(Ссылка.ПериодРегистрации, "ДФ='ММММ гггг'");
	Если Ссылка.ПланФакт = Перечисления.ПланФакт.План Тогда
		ОбластьЗаголовокОсн.Параметры.ПланФакт = "Плановые показатели";
	Иначе
		ОбластьЗаголовокОсн.Параметры.ПланФакт = "Фактические данные";
	КонецЕсли;
	ТабДок.Вывести(ОбластьЗаголовокОсн);
	Для НомерДня = 1 По КолДнейВМес Цикл
		ТабДок.Присоединить(ОбластьЗаголовокДень);
	КонецЦикла;	
	ТабДок.Присоединить(ОбластьЗаголовокИтогВертикальный);
	
	//Шапка
	ТабДок.Вывести(ОбластьШапкаОсн);
	Для НомерДня = 1 По КолДнейВМес Цикл
		ОбластьШапкаДень.Параметры.День = НомерДня;
		ТабДок.Присоединить(ОбластьШапкаДень);
	КонецЦикла;
	ТабДок.Присоединить(ОбластьШапкаИтогВертикальный);
	
	//Строки
	Для Каждого стрДанные Из Ссылка.График Цикл
		Если ЗначениеЗаполнено(стрДанные.Водитель) Тогда
			ОбластьСтрокаОсн.Параметры.Водитель = стрДанные.Водитель;
			ОбластьСтрокаОсн.Параметры.Заполнить(стрДанные.Автомобиль);
			ОбластьСтрокаОсн.Параметры.Автомобиль = стрДанные.Автомобиль;	
			
			ТабДок.Вывести(ОбластьСтрокаОсн);
			
			Для НомерДня = 1 По КолДнейВМес Цикл
				ТекДата = Дата(Год(Ссылка.ПериодРегистрации),Месяц(Ссылка.ПериодРегистрации), НомерДня);
				ДеньНедели = ДеньНедели(ТекДата);
				
				ОбластьСтрокаДень.Параметры.Представление = стрДанные["Представление"+НомерДня];
				
				ТабДок.Присоединить(ОбластьСтрокаДень);
			КонецЦикла;
			ОбластьСтрокаИтогВертикальный.Параметры.Заполнить(стрДанные);
			ТабДок.Присоединить(ОбластьСтрокаИтогВертикальный);
		Иначе
			ПоГрузоподъемностиОсн.Параметры.ИтогиПоГрузоподъемности = стрДанные.Автомобиль;	
			ТабДок.Вывести(ПоГрузоподъемностиОсн);
			
			Для НомерДня = 1 По КолДнейВМес Цикл
				ПоГрузоподъемностиДень.Параметры.Представление = стрДанные["Представление"+НомерДня];
				ТабДок.Присоединить(ПоГрузоподъемностиДень);
			КонецЦикла;
			ТабДок.Присоединить(ПоГрузоподъемностиИтогВертикальный);
		КонецЕсли;
	КонецЦикла;
	
	//Линия
	ТабДок.Вывести(ОбластьЛинияОсн);
	Для НомерДня = 1 По КолДнейВМес Цикл
		ТабДок.Присоединить(ОбластьЛинияДень);
	КонецЦикла;
	ТабДок.Присоединить(ОбластьЛинияИтогВертикальный);
	
	//Расшифровка
	ТабДок.Вывести(РасшифровкаОсн);
	Для НомерДня = 1 По КолДнейВМес Цикл
		ТабДок.Присоединить(РасшифровкаДень);
	КонецЦикла;
	ТабДок.Присоединить(РасшифровкаИтогВертикальный);
	
	//Водители
	ТабДок.Вывести(ВодителиСогласованоОсн);
	Для НомерДня = 1 По КолДнейВМес Цикл
		ТабДок.Присоединить(ВодителиСогласованоДень);
	КонецЦикла;
	ТабДок.Присоединить(ВодителиСогласованоИтогВертикальный);
	
	Для Каждого стрДанные Из Ссылка.График Цикл
		Если Не ЗначениеЗаполнено(стрДанные.Водитель) Тогда
			Продолжить;
		КонецЕсли;
		ВодителиСтрокаОсн.Параметры.Водитель= стрДанные.Водитель;
		ТабДок.Вывести(ВодителиСтрокаОсн);
		Для НомерДня = 1 По КолДнейВМес Цикл
			ТабДок.Присоединить(ВодителиСогласованоДень);
		КонецЦикла;
		ТабДок.Присоединить(ВодителиСогласованоИтогВертикальный);
	КонецЦикла;
	
	//Подвал
	ТабДок.Вывести(ОбластьПодвалОсн);
	Для НомерДня = 1 По КолДнейВМес Цикл
		ТабДок.Присоединить(ОбластьПодвалДень);
	КонецЦикла;
	ТабДок.Присоединить(ОбластьПодвалИтогВертикальный);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСлева = 2;
	ТабДок.ПолеСправа = 2;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
КонецПроцедуры
	
#КонецОбласти

	
#Область Заполнение 

Процедура ЗаполнитьСтрокуДаннымиПоУмолчанию(Объект, НомСтроки) Экспорт 
	
	ТекущаяСтрока = Объект.График[НомСтроки];
	Автомобиль  = ПолучитьАвтомобиль(ТекущаяСтрока.Водитель);
	ТекущаяСтрока.Автомобиль = Автомобиль; 
	
КонецПроцедуры
	
Процедура ЗаполнитьВодителями(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Должность КАК Должность,
	|	Сотрудники.ФизическоеЛицо КАК Водитель,
	|	СвязьВодителейТСПартнеров.Автомобиль КАК Автомобиль,
	|	СвязьВодителейТСПартнеров.Автомобиль.ГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннах,
	|	СвязьВодителейТСПартнеров.Автомобиль.ВместимостьВКубическихМетрах КАК ВместимостьВКубическихМетрах,
	|	СвязьВодителейТСПартнеров.Автомобиль.МаксимальнаяДлинаГруза КАК МаксимальнаяДлинаГруза
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязьВодителейТСПартнеров КАК СвязьВодителейТСПартнеров
	|		ПО Сотрудники.ФизическоеЛицо = СвязьВодителейТСПартнеров.Водитель
	|ГДЕ
	|	Сотрудники.Должность = &Должность
	|	И Сотрудники.Уволен = ЛОЖЬ
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Подразделение = &Подразделение
	|	И Сотрудники.ВГрафике";
	
	Запрос.УстановитьПараметр("Должность", АльтерраОбщегоНазначения.ПолучитьДолжностьВодителя() );
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.График.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;  
	
КонецПроцедуры
	
Процедура ЗаполнитьПоФакту(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРейс.ВремяВыезда, ДЕНЬ) КАК Период,
	|	ЗаданиеНаПеревозкуРейс.Водитель КАК Водитель,
	|	1 КАК Выход
	|ПОМЕСТИТЬ ВТ_ВыходыВодителейФакт
	|ИЗ
	|	Документ.ЗаданиеНаПеревозкуРейс КАК ЗаданиеНаПеревозкуРейс
	|ГДЕ
	|	ЗаданиеНаПеревозкуРейс.ВремяВыезда МЕЖДУ &Дата1 И &Дата2
	|	И ЗаданиеНаПеревозкуРейс.Подразделение = &Подразделение
	|	И НЕ ЗаданиеНаПеревозкуРейс.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикВыходаВодителейОбороты.Период КАК Период,
	|	ГрафикВыходаВодителейОбороты.Водитель КАК Водитель,
	|	ГрафикВыходаВодителейОбороты.ПлановыйВыходОборот КАК ПлановыйВыход,
	|	ГрафикВыходаВодителейОбороты.ВнеплановыйВыходОборот КАК ВнеплановыйВыход,
	|	ГрафикВыходаВодителейОбороты.ВыходнойОборот КАК Выходной,
	|	ГрафикВыходаВодителейОбороты.НеВыходОборот КАК НеВыход
	|ПОМЕСТИТЬ ВТ_ПланВыходов
	|ИЗ
	|	РегистрНакопления.ГрафикВыходаВодителей.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			День,
	|			ПланФакт = &ПланФакт
	|				И Подразделение = &Подразделение) КАК ГрафикВыходаВодителейОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ПланВыходов.Период, ВТ_ВыходыВодителейФакт.Период) КАК Период,
	|	ЕСТЬNULL(ВТ_ПланВыходов.Водитель, ВТ_ВыходыВодителейФакт.Водитель) КАК Водитель,
	|	ЕСТЬNULL(ВТ_ВыходыВодителейФакт.Выход, 0) КАК ФактическийВыход,
	|	ЕСТЬNULL(ВТ_ПланВыходов.ПлановыйВыход, 0) КАК ПлановыйВыход,
	|	ЕСТЬNULL(ВТ_ПланВыходов.ВнеплановыйВыход, 0) КАК ВнеплановыйВыход,
	|	ЕСТЬNULL(ВТ_ПланВыходов.Выходной, 0) КАК Выходной,
	|	ЕСТЬNULL(ВТ_ПланВыходов.НеВыход, 0) КАК НеВыход
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_ПланВыходов КАК ВТ_ПланВыходов
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВыходыВодителейФакт КАК ВТ_ВыходыВодителейФакт
	|		ПО (ВТ_ВыходыВодителейФакт.Водитель = ВТ_ПланВыходов.Водитель)
	|			И (ВТ_ВыходыВодителейФакт.Период = ВТ_ПланВыходов.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Период КАК Период,
	|	ВТ.Водитель КАК Водитель,
	|	ВТ.ФактическийВыход КАК ФактическийВыход,
	|	ВТ.ПлановыйВыход КАК ПлановыйВыход,
	|	ВТ.ВнеплановыйВыход КАК ВнеплановыйВыход,
	|	ВТ.Выходной КАК Выходной,
	|	ВТ.НеВыход КАК НеВыход,
	|	ВЫБОР
	|		КОГДА ВТ.ФактическийВыход = 1
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ПлановыйВыход = 1
	|						ТОГДА ""1""
	|					ИНАЧЕ ""в1""
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.ПлановыйВыход = 1
	|						ИЛИ ВТ.ВнеплановыйВыход = 1
	|					ТОГДА ""н""
	|				ИНАЧЕ ""в""
	|			КОНЕЦ
	|	КОНЕЦ КАК стрВыход
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ПланФакт", Перечисления.ПланФакт.План);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("СтатусГотов", Перечисления.СтатусыВодителей.Готов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		День = День(Выборка.Период);
		
		НайденыеСтроки = Объект.График.НайтиСтроки(Новый Структура("Водитель", Выборка.Водитель));
		Если НайденыеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.График.Добавить();
			НоваяСтрока.Водитель = Выборка.Водитель;
		Иначе
			НоваяСтрока = НайденыеСтроки[0];
		КонецЕсли;
			
		НоваяСтрока["Представление" + День] = Выборка.стрВыход;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область Вспомогательные

Функция ПолучитьАвтомобиль(Водитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьВодителейТСПартнеров.Автомобиль КАК Автомобиль
	|ИЗ
	|	РегистрСведений.СвязьВодителейТСПартнеров КАК СвязьВодителейТСПартнеров
	|ГДЕ
	|	СвязьВодителейТСПартнеров.Водитель = &Водитель";
	
	Запрос.УстановитьПараметр("Водитель", Водитель);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.Автомобиль;
	Иначе
		Возврат Справочники.ТранспортныеСредства.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьАвтомобили(Водитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьВодителейТСПартнеров.Автомобиль КАК Автомобиль
	|ИЗ
	|	РегистрСведений.СвязьВодителейТСПартнеров КАК СвязьВодителейТСПартнеров
	|ГДЕ
	|	СвязьВодителейТСПартнеров.Водитель = &Водитель";
	
	Запрос.УстановитьПараметр("Водитель", Водитель);
	РезультатЗапроса = Запрос.Выполнить();
	мАвтомобилей = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Автомобиль");
	
	Возврат мАвтомобилей;
	
КонецФункции

#КонецОбласти
	
	
#КонецЕсли
